grevaillot/svd_tools/headers/STM32F7x5/otg_hs_global.h
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Host_DPID_SHIFT		15
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Host_DPID_MASK		0x03
/** @defgroup otg_hs_global_otg_hs_grxstsp_host_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Host_BCNT_SHIFT		4
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Host_BCNT_MASK		0x7ff
/** @defgroup otg_hs_global_otg_hs_grxstsp_host_bcnt BCNT Byte count
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Host_CHNUM_SHIFT		0
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Host_CHNUM_MASK		0x0f
/** @defgroup otg_hs_global_otg_hs_grxstsp_host_chnum CHNUM Channel number
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_global_otg_hs_grxstsp_device OTGHSGRXSTSPDevice OTG_HS status read and pop register (peripheral mode)
@{*/


#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Device_FRMNUM_SHIFT		21
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Device_FRMNUM_MASK		0x0f
/** @defgroup otg_hs_global_otg_hs_grxstsp_device_frmnum FRMNUM Frame number
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Device_PKTSTS_SHIFT		17
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Device_PKTSTS_MASK		0x0f
/** @defgroup otg_hs_global_otg_hs_grxstsp_device_pktsts PKTSTS Packet status
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Device_DPID_SHIFT		15
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Device_DPID_MASK		0x03
/** @defgroup otg_hs_global_otg_hs_grxstsp_device_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Device_BCNT_SHIFT		4
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Device_BCNT_MASK		0x7ff
/** @defgroup otg_hs_global_otg_hs_grxstsp_device_bcnt BCNT Byte count
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Device_EPNUM_SHIFT		0
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Device_EPNUM_MASK		0x0f
/** @defgroup otg_hs_global_otg_hs_grxstsp_device_epnum EPNUM Endpoint number
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_global_otg_hs_grxfsiz OTGHSGRXFSIZ OTG_HS Receive FIFO size register
@{*/


#define OTG_HS_GLOBAL_OTG_HS_GRXFSIZ_RXFD_SHIFT		0
#define OTG_HS_GLOBAL_OTG_HS_GRXFSIZ_RXFD_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_grxfsiz_rxfd RXFD RxFIFO depth
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_global_otg_hs_hnptxfsiz_host OTGHSHNPTXFSIZHost OTG_HS nonperiodic transmit FIFO size register (host mode)
@{*/


#define OTG_HS_GLOBAL_OTG_HS_HNPTXFSIZ_Host_NPTXFD_SHIFT		16
#define OTG_HS_GLOBAL_OTG_HS_HNPTXFSIZ_Host_NPTXFD_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_hnptxfsiz_host_nptxfd NPTXFD Nonperiodic TxFIFO depth
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_HNPTXFSIZ_Host_NPTXFSA_SHIFT		0
#define OTG_HS_GLOBAL_OTG_HS_HNPTXFSIZ_Host_NPTXFSA_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_hnptxfsiz_host_nptxfsa NPTXFSA Nonperiodic transmit RAM start address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_global_otg_hs_dieptxf0_device OTGHSDIEPTXF0Device Endpoint 0 transmit FIFO size (peripheral mode)
@{*/


#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF0_Device_TX0FD_SHIFT		16
#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF0_Device_TX0FD_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_dieptxf0_device_tx0fd TX0FD Endpoint 0 TxFIFO depth
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF0_Device_TX0FSA_SHIFT		0
#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF0_Device_TX0FSA_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_dieptxf0_device_tx0fsa TX0FSA Endpoint 0 transmit RAM start address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_global_otg_hs_gnptxsts OTGHSGNPTXSTS OTG_HS nonperiodic transmit FIFO/queue status register
@{*/


#define OTG_HS_GLOBAL_OTG_HS_GNPTXSTS_NPTXQTOP_SHIFT		24
#define OTG_HS_GLOBAL_OTG_HS_GNPTXSTS_NPTXQTOP_MASK		0x7f
/** @defgroup otg_hs_global_otg_hs_gnptxsts_nptxqtop NPTXQTOP Top of the nonperiodic transmit request queue
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_GNPTXSTS_NPTQXSAV_SHIFT		16
#define OTG_HS_GLOBAL_OTG_HS_GNPTXSTS_NPTQXSAV_MASK		0xff
/** @defgroup otg_hs_global_otg_hs_gnptxsts_nptqxsav NPTQXSAV Nonperiodic transmit request queue space available
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_GNPTXSTS_NPTXFSAV_SHIFT		0
#define OTG_HS_GLOBAL_OTG_HS_GNPTXSTS_NPTXFSAV_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_gnptxsts_nptxfsav NPTXFSAV Nonperiodic TxFIFO space available
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_global_otg_hs_gccfg OTGHSGCCFG OTG_HS general core configuration register
@{*/

/** OTG_HS_GLOBAL_OTG_HS_GCCFG_VBDEN USB VBUS detection enable **/
#define OTG_HS_GLOBAL_OTG_HS_GCCFG_VBDEN		(1 << 21)
/** OTG_HS_GLOBAL_OTG_HS_GCCFG_SDEN Secondary detection (SD) mode enable **/
#define OTG_HS_GLOBAL_OTG_HS_GCCFG_SDEN		(1 << 20)
/** OTG_HS_GLOBAL_OTG_HS_GCCFG_PDEN Primary detection (PD) mode enable **/
#define OTG_HS_GLOBAL_OTG_HS_GCCFG_PDEN		(1 << 19)
/** OTG_HS_GLOBAL_OTG_HS_GCCFG_DCDEN Data contact detection (DCD) mode enable **/
#define OTG_HS_GLOBAL_OTG_HS_GCCFG_DCDEN		(1 << 18)
/** OTG_HS_GLOBAL_OTG_HS_GCCFG_BCDEN Battery charging detector (BCD) enable **/
#define OTG_HS_GLOBAL_OTG_HS_GCCFG_BCDEN		(1 << 17)
/** OTG_HS_GLOBAL_OTG_HS_GCCFG_PWRDWN Power down **/
#define OTG_HS_GLOBAL_OTG_HS_GCCFG_PWRDWN		(1 << 16)
/** OTG_HS_GLOBAL_OTG_HS_GCCFG_PS2DET DM pull-up detection status **/
#define OTG_HS_GLOBAL_OTG_HS_GCCFG_PS2DET		(1 << 3)
/** OTG_HS_GLOBAL_OTG_HS_GCCFG_SDET Secondary detection (SD) status **/
#define OTG_HS_GLOBAL_OTG_HS_GCCFG_SDET		(1 << 2)
/** OTG_HS_GLOBAL_OTG_HS_GCCFG_PDET Primary detection (PD) status **/
#define OTG_HS_GLOBAL_OTG_HS_GCCFG_PDET		(1 << 1)
/** OTG_HS_GLOBAL_OTG_HS_GCCFG_DCDET Data contact detection (DCD) status **/
#define OTG_HS_GLOBAL_OTG_HS_GCCFG_DCDET		(1 << 0)

/**@}*/

/** @defgroup otg_hs_global_otg_hs_cid OTGHSCID OTG_HS core ID register
@{*/


#define OTG_HS_GLOBAL_OTG_HS_CID_PRODUCT_ID_SHIFT		0
#define OTG_HS_GLOBAL_OTG_HS_CID_PRODUCT_ID_MASK		0xffffffff
/** @defgroup otg_hs_global_otg_hs_cid_product_id PRODUCTID Product ID field
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_global_otg_hs_glpmcfg OTGHSGLPMCFG OTG core LPM configuration register
@{*/

/** OTG_HS_GLOBAL_OTG_HS_GLPMCFG_ENBESL Enable best effort service latency **/
#define OTG_HS_GLOBAL_OTG_HS_GLPMCFG_ENBESL		(1 << 28)

#define OTG_HS_GLOBAL_OTG_HS_GLPMCFG_LPMRCNTSTS_SHIFT		25
#define OTG_HS_GLOBAL_OTG_HS_GLPMCFG_LPMRCNTSTS_MASK		0x07
/** @defgroup otg_hs_global_otg_hs_glpmcfg_lpmrcntsts LPMRCNTSTS LPM retry count status
@{*/
/**@}*/

/** OTG_HS_GLOBAL_OTG_HS_GLPMCFG_SNDLPM Send LPM transaction **/
#define OTG_HS_GLOBAL_OTG_HS_GLPMCFG_SNDLPM		(1 << 24)

#define OTG_HS_GLOBAL_OTG_HS_GLPMCFG_LPMRCNT_SHIFT		21
#define OTG_HS_GLOBAL_OTG_HS_GLPMCFG_LPMRCNT_MASK		0x07
/** @defgroup otg_hs_global_otg_hs_glpmcfg_lpmrcnt LPMRCNT LPM retry count
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_GLPMCFG_LPMCHIDX_SHIFT		17
#define OTG_HS_GLOBAL_OTG_HS_GLPMCFG_LPMCHIDX_MASK		0x0f
/** @defgroup otg_hs_global_otg_hs_glpmcfg_lpmchidx LPMCHIDX LPM Channel Index
@{*/
/**@}*/

/** OTG_HS_GLOBAL_OTG_HS_GLPMCFG_L1RSMOK Sleep State Resume OK **/
#define OTG_HS_GLOBAL_OTG_HS_GLPMCFG_L1RSMOK		(1 << 16)
/** OTG_HS_GLOBAL_OTG_HS_GLPMCFG_SLPSTS Port sleep status **/
#define OTG_HS_GLOBAL_OTG_HS_GLPMCFG_SLPSTS		(1 << 15)

#define OTG_HS_GLOBAL_OTG_HS_GLPMCFG_LPMRST_SHIFT		13
#define OTG_HS_GLOBAL_OTG_HS_GLPMCFG_LPMRST_MASK		0x03
/** @defgroup otg_hs_global_otg_hs_glpmcfg_lpmrst LPMRST LPM response
@{*/
/**@}*/

