grevaillot/svd_tools/headers/STM32F7x5/otg_hs_global.h
/** OTG_HS_GLOBAL_OTG_HS_GLPMCFG_L1DSEN L1 deep sleep enable **/
#define OTG_HS_GLOBAL_OTG_HS_GLPMCFG_L1DSEN		(1 << 12)

#define OTG_HS_GLOBAL_OTG_HS_GLPMCFG_BESLTHRS_SHIFT		8
#define OTG_HS_GLOBAL_OTG_HS_GLPMCFG_BESLTHRS_MASK		0x0f
/** @defgroup otg_hs_global_otg_hs_glpmcfg_beslthrs BESLTHRS BESL threshold
@{*/
/**@}*/

/** OTG_HS_GLOBAL_OTG_HS_GLPMCFG_L1SSEN L1 Shallow Sleep enable **/
#define OTG_HS_GLOBAL_OTG_HS_GLPMCFG_L1SSEN		(1 << 7)
/** OTG_HS_GLOBAL_OTG_HS_GLPMCFG_REMWAKE bRemoteWake value **/
#define OTG_HS_GLOBAL_OTG_HS_GLPMCFG_REMWAKE		(1 << 6)

#define OTG_HS_GLOBAL_OTG_HS_GLPMCFG_BESL_SHIFT		2
#define OTG_HS_GLOBAL_OTG_HS_GLPMCFG_BESL_MASK		0x0f
/** @defgroup otg_hs_global_otg_hs_glpmcfg_besl BESL Best effort service latency
@{*/
/**@}*/

/** OTG_HS_GLOBAL_OTG_HS_GLPMCFG_LPMACK LPM token acknowledge enable **/
#define OTG_HS_GLOBAL_OTG_HS_GLPMCFG_LPMACK		(1 << 1)
/** OTG_HS_GLOBAL_OTG_HS_GLPMCFG_LPMEN LPM support enable **/
#define OTG_HS_GLOBAL_OTG_HS_GLPMCFG_LPMEN		(1 << 0)

/**@}*/

/** @defgroup otg_hs_global_otg_hs_hptxfsiz OTGHSHPTXFSIZ OTG_HS Host periodic transmit FIFO size register
@{*/


#define OTG_HS_GLOBAL_OTG_HS_HPTXFSIZ_PTXFD_SHIFT		16
#define OTG_HS_GLOBAL_OTG_HS_HPTXFSIZ_PTXFD_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_hptxfsiz_ptxfd PTXFD Host periodic TxFIFO depth
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_HPTXFSIZ_PTXSA_SHIFT		0
#define OTG_HS_GLOBAL_OTG_HS_HPTXFSIZ_PTXSA_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_hptxfsiz_ptxsa PTXSA Host periodic TxFIFO start address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_global_otg_hs_dieptxf1 OTGHSDIEPTXF1 OTG_HS device IN endpoint transmit FIFO size register
@{*/


#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF1_INEPTXFD_SHIFT		16
#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF1_INEPTXFD_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_dieptxf1_ineptxfd INEPTXFD IN endpoint TxFIFO depth
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF1_INEPTXSA_SHIFT		0
#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF1_INEPTXSA_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_dieptxf1_ineptxsa INEPTXSA IN endpoint FIFOx transmit RAM start address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_global_otg_hs_dieptxf2 OTGHSDIEPTXF2 OTG_HS device IN endpoint transmit FIFO size register
@{*/


#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF2_INEPTXFD_SHIFT		16
#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF2_INEPTXFD_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_dieptxf2_ineptxfd INEPTXFD IN endpoint TxFIFO depth
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF2_INEPTXSA_SHIFT		0
#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF2_INEPTXSA_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_dieptxf2_ineptxsa INEPTXSA IN endpoint FIFOx transmit RAM start address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_global_otg_hs_dieptxf3 OTGHSDIEPTXF3 OTG_HS device IN endpoint transmit FIFO size register
@{*/


#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF3_INEPTXFD_SHIFT		16
#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF3_INEPTXFD_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_dieptxf3_ineptxfd INEPTXFD IN endpoint TxFIFO depth
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF3_INEPTXSA_SHIFT		0
#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF3_INEPTXSA_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_dieptxf3_ineptxsa INEPTXSA IN endpoint FIFOx transmit RAM start address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_global_otg_hs_dieptxf4 OTGHSDIEPTXF4 OTG_HS device IN endpoint transmit FIFO size register
@{*/


#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF4_INEPTXFD_SHIFT		16
#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF4_INEPTXFD_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_dieptxf4_ineptxfd INEPTXFD IN endpoint TxFIFO depth
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF4_INEPTXSA_SHIFT		0
#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF4_INEPTXSA_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_dieptxf4_ineptxsa INEPTXSA IN endpoint FIFOx transmit RAM start address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_global_otg_hs_dieptxf5 OTGHSDIEPTXF5 OTG_HS device IN endpoint transmit FIFO size register
@{*/


#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF5_INEPTXFD_SHIFT		16
#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF5_INEPTXFD_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_dieptxf5_ineptxfd INEPTXFD IN endpoint TxFIFO depth
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF5_INEPTXSA_SHIFT		0
#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF5_INEPTXSA_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_dieptxf5_ineptxsa INEPTXSA IN endpoint FIFOx transmit RAM start address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_global_otg_hs_dieptxf6 OTGHSDIEPTXF6 OTG_HS device IN endpoint transmit FIFO size register
@{*/


#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF6_INEPTXFD_SHIFT		16
#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF6_INEPTXFD_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_dieptxf6_ineptxfd INEPTXFD IN endpoint TxFIFO depth
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF6_INEPTXSA_SHIFT		0
#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF6_INEPTXSA_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_dieptxf6_ineptxsa INEPTXSA IN endpoint FIFOx transmit RAM start address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_global_otg_hs_dieptxf7 OTGHSDIEPTXF7 OTG_HS device IN endpoint transmit FIFO size register
@{*/


#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF7_INEPTXFD_SHIFT		16
#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF7_INEPTXFD_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_dieptxf7_ineptxfd INEPTXFD IN endpoint TxFIFO depth
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF7_INEPTXSA_SHIFT		0
#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF7_INEPTXSA_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_dieptxf7_ineptxsa INEPTXSA IN endpoint FIFOx transmit RAM start address
@{*/
/**@}*/


/**@}*/
